# ModelPath Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ModelPath Methods
ModelPath Class See Also
---
The ModelPath type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Compare | Compares this ModelPath with another |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetModelGUID | A GUID identifying the Revit cloud model. |
| GetProjectGUID | A GUID identifying the BIM 360 Docs or Autodesk Docs project to which the model is associated. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ModelPath Class
Autodesk.Revit.DB Namespace